src/test/java/features/ServiceRequest/SR_Payloads/createSR_payload.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:max="http://www.ibm.com/maximo">
   <soapenv:Header/>
    <soapenv:Body>
        <max:CreateGBSSR >
            <max:GBSSRSet>
                <max:SR>
                    <max:CLASS>SR</max:CLASS>
                    <max:ORGID>YVWORG</max:ORGID>
                    <max:SITEID>YVW</max:SITEID>
                    <max:STATUS>NEW</max:STATUS>
                    <max:GBSSADDRESSCODE>#(addressCode)</max:GBSSADDRESSCODE>
                    <max:GBSCUSTOMERNAME>DAFNEY</max:GBSCUSTOMERNAME>
                    <max:GBSMETHODOFADVICE>SMS</max:GBSMETHODOFADVICE>
                    <max:GBSPRODUCT>#(definitionPRODUCT)</max:GBSPRODUCT>
                    <max:GBSASSET>#(definitionASSET)</max:GBSASSET>
                    <max:GBSPLACE>#(definitionPLACE)</max:GBSPLACE>
                    <max:GBSSYMPTOM>#(definitionSYMPTOM)</max:GBSSYMPTOM>
                    <max:GBSEXPECTATION>#(definitionEXPECTATION)</max:GBSEXPECTATION>
                    <max:GBSEFFECT>#(definitionEFFECT)</max:GBSEFFECT>
                    <max:GBSSRTYPE>#(srType)</max:GBSSRTYPE>
                </max:SR>
            </max:GBSSRSet>
        </max:CreateGBSSR>
    </soapenv:Body>
</soapenv:Envelope>